"""
    TODO
    11.11.1
    编写一个程序，通过命令行接受电子邮件地址和文本字符串。然后利用 selenium
    登录到你的邮件账号，将该字符串作为邮件，发送到提供的地址（你也许希望为这
    个程序建立一个独立的邮件账号）。
    这是为程序添加通知功能的一种好方法。你也可以编写类似的程序，从
    Facebook 或 Twitter 账号发送消息。

    11.11.2
    编写一个程序，访问图像共享网站，如 Flickr 或 Imgur，查找一个类型的照片，
    然后下载所有查询结果的图像。可以编写一个程序，访问任何具有查找功能的图像
    网站。

    11.11.3
    2048 是一个简单的游戏，通过箭头向上、下、左、右移动滑块，让滑块合并。
    实际上，你可以通过一遍一遍的重复“上、右、下、左”模式，获得相当高的分数。
    编写一个程序，打开 https://gabrielecirulli.github.io/2048/上的游戏，不断发送上、右、
    下、左按键，自动玩游戏。

    11.11.4
    编写一个程序，对给定的网页 URL，下载该页面所有链接的页面。程序应该标
    记出所有具有 404“Not Found”状态码的页面，将它们作为坏链接输出。
"""


